Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS2B.xml
      <value-group name="USART_CSR__DCD">
        <value name="0" caption="DCD is at 0" value="0"/>
        <value name="1" caption="DCD is at 1" value="1"/>
      </value-group>
      <value-group name="USART_CSR__DCDIC">
        <value name="0" caption="No input change has been detected on the DCD pin since the last read of CSR" value="0"/>
        <value name="1" caption="At least one input change has been detected on the DCD pin since the last read of CSR" value="1"/>
      </value-group>
      <value-group name="USART_CSR__DSR">
        <value name="0" caption="DSR is at 0" value="0"/>
        <value name="1" caption="DSR is at 1" value="1"/>
      </value-group>
      <value-group name="USART_CSR__DSRIC">
        <value name="0" caption="No input change has been detected on the DSR pin since the last read of CSR" value="0"/>
        <value name="1" caption="At least one input change has been detected on the DSR pin since the last read of CSR" value="1"/>
      </value-group>
      <value-group name="USART_CSR__FRAME">
        <value name="0" caption="No stop bit has been detected low since the last RSTSTA" value="0"/>
        <value name="1" caption="At least one stop bit has been detected low since the last RSTSTA" value="1"/>
      </value-group>
      <value-group name="USART_CSR__ITER">
        <value name="0" caption="Maximum number of repetitions has not been reached since the last RSIT" value="0"/>
        <value name="1" caption="Maximum number of repetitions has been reached since the last RSIT" value="1"/>
      </value-group>
      <value-group name="USART_CSR__LINBLS">
        <value name="0" caption="CTS is at 0" value="0"/>
        <value name="1" caption="CTS is at 1" value="1"/>
      </value-group>
      <value-group name="USART_CSR__LINHTE">
        <value name="0" caption="COMM_RX is at 0" value="0"/>
        <value name="1" caption="COMM_RX is at 1" value="1"/>
      </value-group>
      <value-group name="USART_CSR__LINSTE">
        <value name="0" caption="COMM_TX is at 0" value="0"/>
        <value name="1" caption="COMM_TX is at 1" value="1"/>
      </value-group>
      <value-group name="USART_CSR__NACK">
        <value name="0" caption="No Non Acknowledge has not been detected since the last RSTNACK" value="0"/>
        <value name="1" caption="At least one Non Acknowledge has been detected since the last RSTNACK" value="1"/>
      </value-group>
      <value-group name="USART_CSR__OVRE">
        <value name="0" caption="No overrun error has occurred since since the last RSTSTA" value="0"/>
        <value name="1" caption="At least one overrun error has occurred since the last RSTSTA" value="1"/>
      </value-group>
      <value-group name="USART_CSR__PARE">
        <value name="0" caption="No parity error has been detected since the last RSTSTA" value="0"/>
        <value name="1" caption="At least one parity error has been detected since the last RSTSTA" value="1"/>
      </value-group>
      <value-group name="USART_CSR__RI">
        <value name="0" caption="RI is at 0" value="0"/>
        <value name="1" caption="RI is at 1" value="1"/>
      </value-group>
      <value-group name="USART_CSR__RIIC">
        <value name="0" caption="No input change has been detected on the RI pin since the last read of CSR" value="0"/>
        <value name="1" caption="At least one input change has been detected on the RI pin since the last read of CSR" value="1"/>
      </value-group>
      <value-group name="USART_CSR__RXBRK">
        <value name="0" caption="No Break received or End of Break detected since the last RSTSTA" value="0"/>
        <value name="1" caption="Break Received or End of Break detected since the last RSTSTA" value="1"/>
      </value-group>
      <value-group name="USART_CSR__RXBUFF">
        <value name="0" caption="The signal Buffer Full from the Receive PDC channel is inactive" value="0"/>
        <value name="1" caption="The signal Buffer Full from the Receive PDC channel is active" value="1"/>
      </value-group>
      <value-group name="USART_CSR__RXRDY">
        <value name="0" caption="No complete character has been received since the last read of RHR or the receiver is disabled. If characters werebeing received when the receiver was disabled, RXRDY changes to 1 when the receiver is enabled" value="0"/>
        <value name="1" caption="At least one complete character has been received and RHR has not yet been read" value="1"/>
      </value-group>
      <value-group name="USART_CSR__TIMEOUT">
        <value name="0" caption="There has not been a time-out since the last Start Time-out command or the Time-out Register is 0" value="0"/>
        <value name="1" caption="There has been a time-out since the last Start Time-out command" value="1"/>
      </value-group>
      <value-group name="USART_CSR__TXBUFE">
        <value name="0" caption="The signal Buffer Empty from the Transmit PDC channel is inactive" value="0"/>
        <value name="1" caption="The signal Buffer Empty from the Transmit PDC channel is active" value="1"/>
      </value-group>
      <value-group name="USART_CSR__TXEMPTY">
        <value name="0" caption="There are characters in either THR or the Transmit Shift Register, or the transmitter is disabled" value="0"/>
        <value name="1" caption="There is at least one character in either THR or the Transmit Shift Register" value="1"/>
      </value-group>
      <value-group name="USART_CSR__TXRDY">
        <value name="0" caption="A character is in the THR waiting to be transferred to the Transmit Shift Register, or an STTBRK command has been requested, or the transmitter is disabled. As soon as the transmitter is enabled, TXRDY becomes 1" value="0"/>
        <value name="1" caption="There is no character in the THR" value="1"/>
      </value-group>
      <value-group name="USART_CSR__CTS">
        <value name="0" caption="CTS is at 0" value="0"/>
        <value name="1" caption="CTS is at 1" value="1"/>
      </value-group>
